
## :x: Apply Failed (push-server-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/44369)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
null_resource.update-service: Refreshing state... [id=671702548441364657]
random_id.service_name: Refreshing state... [id=aRLM2zJxGks]
pagerduty_service_integration.cloudwatch_non_critical: Refreshing state... [id=P1HC9K2]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
pagerduty_service_integration.sentry: Refreshing state... [id=PKDLN79]
pagerduty_service.non_critical: Refreshing state... [id=PF1VZY8]
pagerduty_service.critical: Refreshing state... [id=PBS7YII]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
pagerduty_service_integration.cloudwatch_critical: Refreshing state... [id=PH4A9UJ]
aws_cloudwatch_log_group.push: Refreshing state... [id=/ecs/Push/Prod/push]
aws_cloudwatch_log_group.config: Refreshing state... [id=/ecs/Push/Prod/config]
aws_sns_topic.alarm_critical: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmCritical]
aws_cloudwatch_metric_alarm.service_scale_in_alarm: Refreshing state... [id=Push Service Queue Size Reduced]
aws_appautoscaling_target.service_autoscaling_target: Refreshing state... [id=service/Push-Prod/PushNotifications6912ccdb32711a4b]
aws_cloudwatch_metric_alarm.service_scale_out_alarm: Refreshing state... [id=Push Service Queue Size Exceeded]
data.terraform_remote_state.incident_management: Read complete after 1s
aws_appautoscaling_policy.service_scale_out_policy: Refreshing state... [id=ScaleOutPolicy]
aws_ecs_cluster.ecs-cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod]
aws_sns_topic_subscription.infrastructure_alarm_non_critical: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmNonCritical:a310d8a5-7daf-45bc-aec1-9ce9ec584b9b]
aws_sns_topic_subscription.infrastructure_alarm_critical: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmCritical:0482da6d-2829-441b-907e-470f919546d1]
aws_sns_topic.alarm_non_critical: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmNonCritical]
aws_ecs_service.push: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/Push-Prod/PushNotifications6912ccdb32711a4b]
aws_appautoscaling_policy.service_scale_in_policy: Refreshing state... [id=ScaleInPolicy]
aws_ecs_task_definition.push: Refreshing state... [id=push-notifications]
aws_security_group.ecs_security_group: Refreshing state... [id=sg-01228425a0e6b2499]
data.aws_kms_alias.kms_alias: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
data.aws_sqs_queue.token-queue: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_sqs_queue.job-queue: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 0s [id=PKAPG94]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_sqs_queue.token-queue: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/996905175585/pocket-push-feedback-queue]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_caller_identity.caller: Reading...
data.aws_sqs_queue.job-queue: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/996905175585/pocket-push-queue]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=2335216153]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=2343592822]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 1s [id=vpc-867638e3]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_in_policy_BF273511" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "Push-Prod-ScaleInPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/Push-Prod/Push-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_out_policy_D03900A2" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "Push-Prod-ScaleOutPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/Push-Prod/Push-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 2
            }
        }
    }

  # aws_appautoscaling_policy.service_scale_in_policy will be destroyed
  # (because aws_appautoscaling_policy.service_scale_in_policy is not in configuration)
  - resource "aws_appautoscaling_policy" "service_scale_in_policy" {
      - alarm_arns         = [
          - "arn:aws:cloudwatch:us-east-1:996905175585:alarm:Push Service Queue Size Reduced",
        ] -> null
      - arn                = "arn:aws:autoscaling:us-east-1:996905175585:scalingPolicy:4a2191f2-6ef9-453f-b4fe-48ba8917abc7:resource/ecs/service/Push-Prod/PushNotifications6912ccdb32711a4b:policyName/ScaleInPolicy" -> null
      - id                 = "ScaleInPolicy" -> null
      - name               = "ScaleInPolicy" -> null
      - policy_type        = "StepScaling" -> null
      - resource_id        = "service/Push-Prod/PushNotifications6912ccdb32711a4b" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null

      - step_scaling_policy_configuration {
          - adjustment_type          = "ChangeInCapacity" -> null
          - cooldown                 = 60 -> null
          - metric_aggregation_type  = "Average" -> null
          - min_adjustment_magnitude = 0 -> null

          - step_adjustment {
              - metric_interval_upper_bound = "0" -> null
              - scaling_adjustment          = -1 -> null
            }
        }
    }

  # aws_appautoscaling_policy.service_scale_out_policy will be destroyed
  # (because aws_appautoscaling_policy.service_scale_out_policy is not in configuration)
  - resource "aws_appautoscaling_policy" "service_scale_out_policy" {
      - alarm_arns         = [
          - "arn:aws:cloudwatch:us-east-1:996905175585:alarm:Push Service Queue Size Exceeded",
        ] -> null
      - arn                = "arn:aws:autoscaling:us-east-1:996905175585:scalingPolicy:4a2191f2-6ef9-453f-b4fe-48ba8917abc7:resource/ecs/service/Push-Prod/PushNotifications6912ccdb32711a4b:policyName/ScaleOutPolicy" -> null
      - id                 = "ScaleOutPolicy" -> null
      - name               = "ScaleOutPolicy" -> null
      - policy_type        = "StepScaling" -> null
      - resource_id        = "service/Push-Prod/PushNotifications6912ccdb32711a4b" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null

      - step_scaling_policy_configuration {
          - adjustment_type          = "ChangeInCapacity" -> null
          - cooldown                 = 600 -> null
          - metric_aggregation_type  = "Average" -> null
          - min_adjustment_magnitude = 0 -> null

          - step_adjustment {
              - metric_interval_lower_bound = "0" -> null
              - scaling_adjustment          = 2 -> null
            }
        }
    }

  # aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99 will be created
  + resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 2
      + resource_id        = "service/Push-Prod/Push-Prod"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # aws_appautoscaling_target.service_autoscaling_target will be destroyed
  # (because aws_appautoscaling_target.service_autoscaling_target is not in configuration)
  - resource "aws_appautoscaling_target" "service_autoscaling_target" {
      - arn                = "arn:aws:application-autoscaling:us-east-1:996905175585:scalable-target/0ec54a2191f26ef9453fb4fe48ba8917abc7" -> null
      - id                 = "service/Push-Prod/PushNotifications6912ccdb32711a4b" -> null
      - max_capacity       = 10 -> null
      - min_capacity       = 1 -> null
      - resource_id        = "service/Push-Prod/PushNotifications6912ccdb32711a4b" -> null
      - role_arn           = "arn:aws:iam::996905175585:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> null
      - scalable_dimension = "ecs:service:DesiredCount" -> null
      - service_namespace  = "ecs" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED will be created
  + resource "aws_cloudwatch_dashboard" "application_cloudwatch-dashboard_1F3DC0ED" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + annotations = {
                              + horizontal = [
                                  + {
                                      + color = "#e377c2"
                                      + label = "CPU scale out"
                                      + value = 45
                                    },
                                  + {
                                      + color = "#c5b0d5"
                                      + label = "CPU scale in"
                                      + value = 30
                                    },
                                ]
                            }
                          + metrics     = [
                              + [
                                  + "ECS/ContainerInsights",
                                  + "RunningTaskCount",
                                  + "ServiceName",
                                  + "Push-Prod",
                                  + "ClusterName",
                                  + "Push-Prod",
                                  + {
                                      + color = "#c49c94"
                                      + yAxis = "right"
                                    },
                                ],
                              + [
                                  + "AWS/ECS",
                                  + "CPUUtilization",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + color = "#f7b6d2"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "MemoryUtilization",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + color = "#c7c7c7"
                                    },
                                ],
                            ]
                          + period      = 60
                          + region      = "us-east-1"
                          + stacked     = false
                          + stat        = "Average"
                          + title       = "Service Load"
                          + view        = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 6
                    },
                ]
            }
        )
      + dashboard_name = "Push-Prod"
      + id             = (known after apply)
    }

  # aws_cloudwatch_log_group.app-log-group will be created
  + resource "aws_cloudwatch_log_group" "app-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/Push-Prod/ecs/app"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
    }

  # aws_cloudwatch_log_group.aws-otel-collector-log-group will be created
  + resource "aws_cloudwatch_log_group" "aws-otel-collector-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/Push-Prod/ecs/aws-otel-collector"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "Push"
        }
    }

  # aws_cloudwatch_log_group.config will be destroyed
  # (because aws_cloudwatch_log_group.config is not in configuration)
  - resource "aws_cloudwatch_log_group" "config" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/ecs/Push/Prod/config" -> null
      - id                = "/ecs/Push/Prod/config" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/Push/Prod/config" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "environment" = "Prod"
          - "service"     = "Push"
        } -> null
      - tags_all          = {
          - "environment" = "Prod"
          - "service"     = "Push"
        } -> null
    }

  # aws_cloudwatch_log_group.push will be destroyed
  # (because aws_cloudwatch_log_group.push is not in configuration)
  - resource "aws_cloudwatch_log_group" "push" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/ecs/Push/Prod/push" -> null
      - id                = "/ecs/Push/Prod/push" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/Push/Prod/push" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "environment" = "Prod"
          - "service"     = "Push"
        } -> null
      - tags_all          = {
          - "environment" = "Prod"
          - "service"     = "Push"
        } -> null
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1 will be created
  + resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_in_alarm_850BE3A1" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm to reduce capacity if container CPU is low"
      + alarm_name                            = "Push-Prod Service Low CPU"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "Push-Prod"
          + "ServiceName" = "Push-Prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

be destroyed
  # (because random_id.service_name is not in configuration)
  - resource "random_id" "service_name" {
      - b64_std     = "PushNotificationsaRLM2zJxGks=" -> null
      - b64_url     = "PushNotificationsaRLM2zJxGks" -> null
      - byte_length = 8 -> null
      - dec         = "PushNotifications7571339165379402315" -> null
      - hex         = "PushNotifications6912ccdb32711a4b" -> null
      - id          = "aRLM2zJxGks" -> null
      - keepers     = {
          - "version" = "v3"
        } -> null
      - prefix      = "PushNotifications" -> null
    }

Plan: 31 to add, 0 to change, 22 to destroy.
null_resource.update-service: Destroying... [id=671702548441364657]
null_resource.update-service: Destruction complete after 0s
pagerduty_service_integration.sentry: Destroying... [id=PKDLN79]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Creating...
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Creating...
aws_sns_topic_subscription.infrastructure_alarm_non_critical: Destroying... [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmNonCritical:a310d8a5-7daf-45bc-aec1-9ce9ec584b9b]
aws_cloudwatch_metric_alarm.service_scale_in_alarm: Destroying... [id=Push Service Queue Size Reduced]
aws_cloudwatch_metric_alarm.service_scale_out_alarm: Destroying... [id=Push Service Queue Size Exceeded]
aws_sns_topic_subscription.infrastructure_alarm_critical: Destroying... [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmCritical:0482da6d-2829-441b-907e-470f919546d1]
aws_security_group.ecs_security_group: Destroying... [id=sg-01228425a0e6b2499]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Creating...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Creating...
aws_cloudwatch_metric_alarm.service_scale_out_alarm: Destruction complete after 0s
aws_cloudwatch_log_group.aws-otel-collector-log-group: Creating...
aws_cloudwatch_metric_alarm.service_scale_in_alarm: Destruction complete after 0s
aws_cloudwatch_log_group.app-log-group: Creating...
aws_sns_topic_subscription.infrastructure_alarm_critical: Destruction complete after 0s
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Creating...
aws_sns_topic_subscription.infrastructure_alarm_non_critical: Destruction complete after 0s
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Creating...
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Creation complete after 0s [id=push-prod-app]
aws_appautoscaling_policy.service_scale_out_policy: Destroying... [id=ScaleOutPolicy]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Creation complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-Infrastructure-Alarm-Non-Critical]
aws_appautoscaling_policy.service_scale_in_policy: Destroying... [id=ScaleInPolicy]
aws_cloudwatch_log_group.aws-otel-collector-log-group: Creation complete after 0s [id=/Backend/Push-Prod/ecs/aws-otel-collector]
aws_sns_topic.alarm_critical: Destroying... [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmCritical]
aws_cloudwatch_log_group.app-log-group: Creation complete after 0s [id=/Backend/Push-Prod/ecs/app]
pagerduty_service_integration.cloudwatch_critical: Destroying... [id=PH4A9UJ]
pagerduty_service_integration.sentry: Destruction complete after 0s
aws_sns_topic.alarm_non_critical: Destroying... [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-InfrastructureAlarmNonCritical]
aws_security_group.ecs_security_group: Destruction complete after 0s
pagerduty_service_integration.cloudwatch_non_critical: Destroying... [id=P1HC9K2]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Creation complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-Infrastructure-Alarm-Critical]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Creating...
aws_sns_topic.alarm_critical: Destruction complete after 0s
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Creating...
aws_appautoscaling_policy.service_scale_out_policy: Destruction complete after 0s
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Creating...
aws_sns_topic.alarm_non_critical: Destruction complete after 0s
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Creating...
aws_appautoscaling_policy.service_scale_in_policy: Destruction complete after 0s
pagerduty_service_integration.cloudwatch_critical: Destruction complete after 0s
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Creating...
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Creating...
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Creation complete after 0s [id=Push-Prod-TaskRole]
aws_appautoscaling_target.service_autoscaling_target: Destroying... [id=service/Push-Prod/PushNotifications6912ccdb32711a4b]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Creation complete after 1s [id=push-prod-app]
pagerduty_service.critical: Destroying... [id=PBS7YII]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Creation complete after 1s [id=Push-Prod-TaskExecutionRole]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Creation complete after 1s [id=arn:aws:iam::996905175585:policy/Push-Prod-TaskExecutionRolePolicy]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Creating...
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Creation complete after 1s [id=PZ1Z8AP]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Creating...
pagerduty_service_integration.cloudwatch_non_critical: Destruction complete after 1s
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creating...
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Creation complete after 1s [id=arn:aws:iam::996905175585:policy/Push-Prod-TaskRolePolicy]
pagerduty_service.non_critical: Destroying... [id=PF1VZY8]
aws_appautoscaling_target.service_autoscaling_target: Destruction complete after 1s
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creating...
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Creation complete after 1s [id=PVSO7KM]
aws_ecs_service.push: Destroying... [id=arn:aws:ecs:us-east-1:996905175585:service/Push-Prod/PushNotifications6912ccdb32711a4b]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Creation complete after 0s [id=Push-Prod-TaskExecutionRole-20240208203930596000000002]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Creating...
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Creation complete after 0s [id=Push-Prod-TaskExecutionRole-20240208203930621500000003]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=Push-Prod]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creating...
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Creation complete after 0s [id=Push-Prod-TaskRole-20240208203930710600000004]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creation complete after 0s [id=PVOEZBF]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creation complete after 0s [id=PRCTYMS]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creation complete after 0s [id=PO35YN2]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creation complete after 0s [id=P7THXXC]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creating...
pagerduty_service.non_critical: Destruction complete after 1s
pagerduty_service.critical: Destruction complete after 1s
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creation complete after 1s [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-Infrastructure-Alarm-Critical:48c96710-e5b9-4b34-98aa-d4b6535242e4]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creation complete after 1s [id=arn:aws:sns:us-east-1:996905175585:Push-Prod-Infrastructure-Alarm-Non-Critical:51137eeb-8293-4b66-bf51-6749746f2928]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Creation complete after 2s [id=sg-02bf7be3db7520f58]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Still creating... [10s elapsed]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Creation complete after 10s [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Creating...
aws_ecs_service.push: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:serv...Prod/PushNotifications6912ccdb32711a4b, 10s elapsed]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Creation complete after 1s [id=arn:aws:ecs:us-east-1:996905175585:service/Push-Prod/Push-Prod]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Creating...
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Creating...
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Creation complete after 0s [id=service/Push-Prod/Push-Prod]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Creating...
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Creating...
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Creation complete after 0s [id=Push-Prod]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Creation complete after 0s [id=Push-Prod-ScaleInPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Creating...
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Creation complete after 0s [id=Push-Prod-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Creating...
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Creation complete after 1s [id=Push-Prod Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Creation complete after 1s [id=Push-Prod Service High CPU]
aws_ecs_service.push: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:serv...Prod/PushNotifications6912ccdb32711a4b, 20s elapsed]
aws_ecs_service.push: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:serv...Prod/PushNotifications6912ccdb32711a4b, 30s elapsed]
aws_ecs_service.push: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:serv...Prod/PushNotifications6912ccdb32711a4b, 40s elapsed]
aws_ecs_service.push: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:serv...Prod/PushNotifications6912ccdb32711a4b, 50s elapsed]
aws_ecs_service.push: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:serv...Prod/PushNotifications6912ccdb32711a4b, 1m0s elapsed]
aws_ecs_service.push: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:serv...Prod/PushNotifications6912ccdb32711a4b, 1m10s elapsed]
aws_ecs_service.push: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:serv...Prod/PushNotifications6912ccdb32711a4b, 1m20s elapsed]
aws_ecs_service.push: Destruction complete after 1m26s
random_id.service_name: Destroying... [id=aRLM2zJxGks]
random_id.service_name: Destruction complete after 0s
aws_ecs_cluster.ecs-cluster: Destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod]
aws_ecs_task_definition.push: Destroying... [id=push-notifications]
aws_ecs_task_definition.push: Destruction complete after 0s
aws_cloudwatch_log_group.push: Destroying... [id=/ecs/Push/Prod/push]
aws_cloudwatch_log_group.config: Destroying... [id=/ecs/Push/Prod/config]
aws_cloudwatch_log_group.push: Destruction complete after 0s
aws_cloudwatch_log_group.config: Destruction complete after 0s
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 10s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 20s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 30s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 40s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 50s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 1m0s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 1m10s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 1m20s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 1m30s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 1m40s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 1m50s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 2m0s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 2m10s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 2m20s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 2m30s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 2m40s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 2m50s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 3m0s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 3m10s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 3m20s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 3m30s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 3m40s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 3m50s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 4m0s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 4m10s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 4m20s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 4m30s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 4m40s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 4m50s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 5m0s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 5m10s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 5m20s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 5m30s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 5m40s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 5m50s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 6m0s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 6m10s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 6m20s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 6m30s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 6m40s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 6m50s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 7m0s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 7m10s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 7m20s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 7m30s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 7m40s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 7m50s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 8m0s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 8m10s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 8m20s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 8m30s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 8m40s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 8m50s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 9m0s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 9m10s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 9m20s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 9m30s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 9m40s elapsed]
aws_ecs_cluster.ecs-cluster: Still destroying... [id=arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod, 9m50s elapsed]
╷
│ Error: deleting ECS Cluster (arn:aws:ecs:us-east-1:996905175585:cluster/Push-Prod): ClusterContainsServicesException: The Cluster cannot be deleted while Services are active.
│ 
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"601e078f-c61d-4eed-9056-58ddd58ce192","JobName":"push-server_infrastructure_apply_prod","PRNumber":157,"Program":"tfcmt","SHA1":"456ac15435f7e7a4ea0c81bec90fd05e9cd41460","Target":"push-server-cdk","Vars":{}} -->